{
    "1. Линейные уравнения с одной переменной": {
      "Определение": "Линейное уравнение с одной переменной — это уравнение вида <i>a</i>x + <i>b</i> = 0, где <i>x</i> — переменная, а <i>a</i> и <i>b</i> — числовые коэффициенты, причём <i>a</i> ≠ 0. Число <i>a</i> называется коэффициентом при переменной, а <i>b</i> — свободным членом.",
      "Примеры линейных уравнений": ["2<i>x</i> + 3 = 0", "-<i>x</i> - 5 = 0", "4.5<i>x</i> + 1 = 0"],
      "Решение линейных уравнений": "Решение линейного уравнения — это значение переменной <i>x</i>, при котором уравнение обращается в верное числовое равенство. Чтобы найти это значение, нужно выполнить следующие шаги: Перенести все члены уравнения с переменной <i>x</i> на одну сторону, а числовые члены — на другую. Привести подобные слагаемые. Разделить обе части уравнения на коэффициент при <i>x</i>."
    },
    "2. Многочлены": {
      "Определение": "<i>Многочлен</i> — это математическое выражение, состоящее из суммы или разности членов, каждый из которых является произведением некоторой константы (называемой коэффициентом) и переменной, возведенной в некоторую степень, причем эта степень является неотрицательным целым числом.",
      "Сложение и вычитание многочленов": {
        "Теория": "Сложение и вычитание многочленов позволяют комбинировать или разделять алгебраические выражения. Эти операции основываются на работе с подобными членами — членами с одинаковыми переменными и степенями.",
        "Основные правила": "Сложение многочленов выполняется путем суммирования коэффициентов подобных членов.\nВычитание многочленов производится путем вычитания коэффициентов подобных членов.",
        "Примеры": {
          "Сложение многочленов": "Чтобы сложить два многочлена, нужно суммировать их соответствующие термы. Подобные термы — это термы, которые имеют одинаковую переменную, возведенную в одинаковую степень.",
          "Результат вычитания": "4<i>x</i><sup>2</sup> - 2<i>x</i> – 13"
        }
      },
      "Умножение многочленов": {
        "Умножение одночлена на многочлен": "Одночлен – это алгебраическое выражение с одним членом. Многочлен – это выражение, которое состоит из нескольких одночленов. Примеры умножения одночлена на многочлен: <i>x</i><sup3</sup> + (<i>x</i><sup>2</sup> + 3<i>x</i><sup>2</sup>) + (4<i>x</i> + 3<i>x</i>) + 12, получаем окончательный ответ: <i>x</i><sup>3</sup> + 4<i>x</i><sup>2</sup> + 7<i>x</i> + 12."
      },
      "Разложение многочлена на множители": {
        "Вынесение общего множителя за скобки": "Вынесение общего множителя за скобки — это метод упрощения многочлена, при котором из всех его членов выделяется общий множитель. Например, при разложении многочлена 4<i>x</i><sup>4</sup> + 8<i>x</i><sup>3</sup> - 12<i>x</i><sup>2</sup> выносится общий множитель 4<i>x</i><sup>2</sup>, получаем 4<i>x</i><sup>2</sup>(<i>x</i><sup>2</sup> + 2<i>x</i> - 3).",
        "Сложение и вычитание многочленов": "Группировка многочленов — это способ факторизации, который используется, когда многочлен содержит четыре или более члена. Идея состоит в том, чтобы разделить многочлен на группы с общими множителями, а затем вынести эти общие множители за скобки. Например, при группировке и факторизации многочлена <i>x</i><sup>3</sup> + 2<i>x</i><sup>2</sup> + <i>x</i> + 2, мы можем разделить его на две группы (<i>x</i><sup>3</sup> + 2<i>x</i><sup>2</sup>) и (<i>x</i> + 2), затем вынести <i>x</i><sup>2</sup> как общий множитель в первой группе и получить <i>x</i><sup>2</sup>(<i>x</i> + 2) + 1(<i>x</i> + 2), что дает нам (<i>x</i><sup>2</sup> + 1)(<i>x</i> + 2) как итоговую факторизацию."
      }
    }
  }
  